In [39]:
import pandas as pd

In [86]:
trips = pd.read_csv("Seattle_cycles_trip.csv")
stations = pd.read_csv("Seattle_cycles_station.csv")
weather = pd.read_csv("Seattle_weather_daily.csv")

C:\Users\Admin\AppData\Local\Temp\ipykernel_3752\3025706063.py:1: DtypeWarning: Columns (11) have mixed types. Specify dtype option on import or set low_memory=False.
  trips = pd.read_csv("Seattle_cycles_trip.csv")

In [87]:
trips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 286858 entries, 0 to 286857
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   trip_id            286858 non-null  int64
 1   starttime          286858 non-null  object
 2   stoptime           286858 non-null  object
 3   bikeid             286858 non-null  object
 4   tripduration       286858 non-null  float64
 5   from_station_name  286858 non-null  object
 6   to_station_name    286858 non-null  object
 7   from_station_id    286858 non-null  object
 8   to_station_id      286858 non-null  object
 9   usertype           286858 non-null  object
 10  gender             181558 non-null  object
 11  birthyear          181554 non-null  object
dtypes: float64(1), int64(1), object(10)
memory usage: 26.3+ MB

In [88]:
trips['starttime'] = pd.to_datetime(trips['starttime'])

In [89]:
trips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 286858 entries, 0 to 286857
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   trip_id            286858 non-null  int64
 1   starttime          286858 non-null  datetime64[ns]
 2   stoptime           286858 non-null  object
 3   bikeid             286858 non-null  object
 4   tripduration       286858 non-null  float64
 5   from_station_name  286858 non-null  object
 6   to_station_name    286858 non-null  object
 7   from_station_id    286858 non-null  object
 8   to_station_id      286858 non-null  object
 9   usertype           286858 non-null  object
 10  gender             181558 non-null  object
 11  birthyear          181554 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(1), object(9)
memory usage: 26.3+ MB

In [90]:
trips.drop(['stoptime', 'bikeid', 'tripduration', 'to_station_name', 'from_station_id', 'usertype', 'gender', 'birthyear'], axis=1, inplace=True)

In [91]:
trips['date']=trips['starttime'].dt.date

In [92]:
trips.head()

   trip_id           starttime    from_station_name to_station_id        date
0      431 2014-10-13 10:31:00  2nd Ave & Spring St         PS-04  2014-10-13
1      432 2014-10-13 10:32:00  2nd Ave & Spring St         PS-04  2014-10-13
2      433 2014-10-13 10:33:00  2nd Ave & Spring St         PS-04  2014-10-13
3      434 2014-10-13 10:34:00  2nd Ave & Spring St         PS-04  2014-10-13
4      435 2014-10-13 10:34:00  2nd Ave & Spring St         PS-04  2014-10-13

In [93]:
trips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 286858 entries, 0 to 286857
Data columns (total 5 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   trip_id            286858 non-null  int64
 1   starttime          286858 non-null  datetime64[ns]
 2   from_station_name  286858 non-null  object
 3   to_station_id      286858 non-null  object
 4   date               286858 non-null  object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 10.9+ MB

In [94]:
trips['date'] = pd.to_datetime(trips['date'])

In [95]:
trips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 286858 entries, 0 to 286857
Data columns (total 5 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   trip_id            286858 non-null  int64
 1   starttime          286858 non-null  datetime64[ns]
 2   from_station_name  286858 non-null  object
 3   to_station_id      286858 non-null  object
 4   date               286858 non-null  datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(2)
memory usage: 10.9+ MB

In [96]:
trips.drop(['starttime'], axis=1, inplace=True)

In [97]:
trips.head()

   trip_id    from_station_name to_station_id       date
0      431  2nd Ave & Spring St         PS-04 2014-10-13
1      432  2nd Ave & Spring St         PS-04 2014-10-13
2      433  2nd Ave & Spring St         PS-04 2014-10-13
3      434  2nd Ave & Spring St         PS-04 2014-10-13
4      435  2nd Ave & Spring St         PS-04 2014-10-13

In [98]:
stations.head()

,station_id,name,lat,long,install_date,install_dockcount,modification_date,current_dockcount,decommission_date
0,BT-01,3rd Ave & Broad St,47.618418,-122.350964,10/13/2014,18,NaN,18,NaN
1,BT-03,2nd Ave & Vine St,47.615829,-122.348564,10/13/2014,16,NaN,16,NaN
2,BT-04,6th Ave & Blanchard St,47.616094,-122.341102,10/13/2014,16,NaN,16,NaN
3,BT-05,2nd Ave & Blanchard St,47.613110,-122.344208,10/13/2014,14,NaN,14,NaN
4,CBD-03,7th Ave & Union St,47.610731,-122.332447,10/13/2014,20,NaN,20,NaN

In [99]:
stations.decommission_date.unique()

array([nan, '8/9/2016', '3/18/2016', '7/2/2016', '10/29/2015'],
      dtype=object)

In [106]:
active_stations=stations[stations['decommission_date'].isnull()]

In [107]:
active_stations.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 54 entries, 0 to 57
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   station_id         54 non-null     object
 1   name               54 non-null     object
 2   lat                54 non-null     float64
 3   long               54 non-null     float64
 4   install_date       54 non-null     object
 5   install_dockcount  54 non-null     int64
 6   modification_date  13 non-null     object
 7   current_dockcount  54 non-null     int64
 8   decommission_date  0 non-null      object
dtypes: float64(2), int64(2), object(5)
memory usage: 4.2+ KB